INSERT INTO `knowledge`(`id`, `title`, `content`, `picture`) VALUES (1, '习近平2023年2月7日在党的二十大精神研讨班开班式上的讲话', '党的领导决定中国式现代化的根本性质。我们党坚持把马克思主义作为根本指导思想，不断深化对共产党执政规律、社会主义建设规律、人类社会发展规律的认识，不断开辟马克思主义中国化时代化新境界，为中国式现代化提供科学指引。', 'pic1.jpg');
INSERT INTO `knowledge`(`id`, `title`, `content`, `picture`) VALUES (2, '习近平2023年2月7日在党的二十大精神研讨班开班式上的讲话', '党的十八大以来，我们党在已有基础上继续前进，不断实现理论和实践上的创新突破，成功推进和拓展了中国式现代化。我们在战略上不断完善，深入实施科教兴国战略、人才强国战略、乡村振兴战略等一系列重大战略，为中国式现代化提供坚实战略支撑。',  'pic1.png');
INSERT INTO `knowledge`(`id`, `title`, `content`, `picture`) VALUES (3, '习近平2023年3月1日在中央党校建校90周年庆祝大会暨2023年春季学期开学典礼上的讲话', '各级党校要把党性教育作为教学的主要内容，深入开展理想信念、党的宗旨、“四史”、革命传统、中华民族传统美德、党风廉政等教育，把党章和党规党纪学习教育作为党性教育的重要内容。',  'pic5.png');
INSERT INTO `knowledge`(`id`, `title`, `content`, `picture`) VALUES (4, '中国共产党的党史', '中国共产党成立于1921年，经过多年的斗争和发展，已经成为中国最高领导力量和领导核心，为中国的现代化建设和全面深化改革提供了坚强保证。',  'pic5.png');
INSERT INTO `knowledge`(`id`, `title`, `content`, `picture`) VALUES (5, '中国共产党的组织体系', '中国共产党的组织体系由中央委员会、中央纪律检查委员会、中央组织部等组成，形成了一套完整的党内机构体系，为党的事业的顺利进行提供了组织保障。',  'pic5.png');
INSERT INTO `knowledge`(`id`, `title`, `content`, `picture`) VALUES (6, '中国共产党的群众路线', '中国共产党始终坚持群众路线，把人民群众放在心中最高的位置，从人民群众中汲取力量，为人民群众服务，不断推进中国特色社会主义事业。',  'pic5.png');
INSERT INTO `knowledge`(`id`, `title`, `content`, `picture`) VALUES (7, '中国共产党的党风廉政建设', '中国共产党高度重视党风廉政建设，加强党的思想建设、组织建设、制度建设和文化建设，坚决反对腐败现象，为党的事业提供坚强保障。',  'pic5.png');
